{
  "contact": {
    "phone": "480.221.3794",
    "email": "joshkewley@outlook.com",
    "location": "Brentwood, Tennessee"
  },
  "fullname": "Josh Kewley",
  "role": "Azure Architect",
  "summary": "I'm an experienced Azure Architect with a deep Microsoft-focused development background. I have a track record of helping businesses large and small plan for, migrate, and modernize their workloads in the Azure cloud. I'm an Azure fanatic and automation enthusiast who enjoys the delivery side of IT consulting. My background as a small business owner enriches my ability to understand and relate to the concerns of my clients. I am looking for an opportunity to apply my experience with team leadership, software development, and Microsoft Azure in a position with an organization which focuses on quality of delivery.",
  "skills": [{
      "title": "Azure",
      "type": "percent",
      "subskills": [{
          "name": "Cloud Architecture",
          "percent": 89
        },
        {
          "name": "PaaS / Serverless",
          "percent": 95
        },
        {
          "name": "IaaS",
          "percent": 75
        },
        {
          "name": "Networking",
          "percent": 70
        },
        {
          "name": "Identity",
          "percent": 85
        },
        {
          "name": "Dev Ops",
          "percent": 90
        },
        {
          "name": "Application Insights",
          "percent": 89
        },
        {
          "name": "Powershell & Azure CLI",
          "percent": 95
        }
      ]
    },
    {
      "title": "Languages",
      "type": "percent",
      "subskills": [{
          "name": "C#",
          "percent": 95
        },
        {
          "name": "Javascript",
          "percent": 85
        },
        {
          "name": "Typescript",
          "percent": 80
        },
        {
          "name": "Java",
          "percent": 75
        },
        {
          "name": "T-SQL",
          "percent": 75
        }
      ]
    },
    {
      "title": "Frameworks",
      "type": "tag",
      "subskills": [{
          "name": ".Net Core"
        },
        {
          "name": ".Net Framework"
        },
        {
          "name": "MSAL"
        },
        {
          "name": "ARM"
        },
        {
          "name": "Angular"
        },
        {
          "name": "Spring"
        },
        {
          "name": "Node"
        },
        {
          "name": "Entity Framework"
        }
      ]
    },
    {
      "title": "Tools / Platforms",
      "type": "tag",
      "subskills": [{
          "name": "Visual Studio"
        },
        {
          "name": "Visual Studio Code"
        },
        {
          "name": "Azure Dev Ops"
        },
        {
          "name": "Docker"
        },
        {
          "name": "Terraform"
        },
        {
          "name": "Powershell"
        },
        {
          "name": "Azure CLI"
        },
        {
          "name": "MS SQL"
        },
        {
          "name": "Postman"
        },
        {
          "name": "IntelliJ"
        }
      ]
    }
  ],
  "education": [{
      "institution": "James Madison University",
      "degree": "",
      "start": "1992",
      "end": "1992"
    },
    {
      "institution": "Scottsdale Community College",
      "degree": "",
      "start": "1994",
      "end": "1995"
    },
    {
      "institution": "Arizona State University",
      "degree": "",
      "start": "1995",
      "end": "1995"
    }
  ],
  "experience": [{
      "role": "Technical Lead",
      "company": "Kroger Pharmacy",
      "via": "Blue Chip Consulting Group",
      "brief": "Technical lead for Kroger Pharmacy's first Azure deployment. We migrated a Cold Fusion web app to Java and authentication mechanisms from LDAP / SiteMinder to Azure Active Directory.",
      "description": "As a tech lead for the spearhead project with Kroger Pharmacy, I led a team in the modernization of a LOB Cold Fusion web application. Our team collaborated with Kroger Pharmacy IT to bring their first architecture to the cloud which featured private networking features, Linux PaaS services, and Terraform CI/CD processes. In addition, we delivered a reference architecture and claims mapping strategies for Angular applications with Java back ends built on top of Azure Active Directory authentication. I helped shape naming convention guidelines for the broader Kroger organization based on work I had done over the years with other organizations who were new to Azure. Our team delivery was celebrated inside Kroger, leading to millions of dollars in additional multi-year contract work.",
      "start": "08/2020",
      "end": "06/2021",
      "tags": {
        "Cloud": "The application was deployed to a Linux app service instance and leveraged private endpoint support across Azure SQL and Azure storage accounts. Application Insights and Azure Data Factory also played important roles in the deliverable's makeup.",
        "Code": "The Angular application was built on Kroger's standard of Angular 8. It leveraged ngrx for state management and MSAL for OAuth user flows. The application's API layer was written in Java 8 on top of Spring Boot. Logging to application insights via Log4j provided support teams with key performance and user metrics. Hundreds of unit tests provide the team with a safety net during refactorings and pull request validations.",
        "Identity": "Our migration piloted AAD authentication for employee accounts within Kroger Pharmacy. I combined a claims mapping policy with directory extensions and application roles to provide a familiar single sign on login experience using authorization code flow with PKCE.",
        "Data": "The legacy version of the application was built on SSIS powered ETL flows. During the modernization effort these flows were hardened and adapted to Azure monitoring platforms. The data representing newer metrics was sourced via Azure Data Lake and Azure Data Factory.",
        "Modernize": "Originally written as a Cold Fusion app running internally on IIS, the task was to modernize the application by moving to Java and Linux hosting environment in Azure. Kroger had aggressive goals for an MVP release based on the close of their fiscal calendar. An agile approach allowed us to work with stakeholders to prioritize modernization efforts and application improvements where they were needed most, while helping us build out a detailed backlog to help shape future development efforts.",
        "DevOps": "I contributed to the initial Terraform recipies for hub-and-spoke App Service Plan deployments and helped the in-house DevOps team understand DevOps authorization and deployment strategies. We also built a custom pipeline approach for database deployments based on Entity Framework's approach."
      }
    },
    {
      "role": "DevOps Consultant",
      "company": "Walgreens Boots Alliance",
      "via": "Microsoft Consulting Services",
      "brief": "Built custom tooling to support DevOps processes used by Microsoft's internal IaaS application migration teams (LEAP).",
      "description": "In a stand-alone role within WBA, I was responsible for designing the DevOps processes leveraged by IaaS-focused engineers on Microsoft's LEAP team to lift and shift hundreds of applications into Azure. The solution featured private build agents, application onboarding and pipeline creation automation, and a domain specific language which abstracted the technical requirements of the underlying Azure architecture, allowing Microsoft engineers to remain focused on application inventories without having to be fully knowledgable of WBA's security, architecture, and deployment requirements. I also became a key policy contributor for Azure naming conventions leveraged by WBA teams across the globe.",
      "start": "02/2020",
      "end": "09/2020",
      "tags": {
        "Cloud": "Applications being migrated by the Microsoft teams were lift and shift Windows and Linux machines. Deployment variables for selections such as disk sizes, networking features, local agent installs and post-deployment scripting/hardening were implemented as templates with integration hooks to support ever-expanding requirements.",
        "Code": "ARM templates which enforced WBA deployment standards and naming conventions were abstracted from modernization teams through the use of JSON-based specification documents. Custom JSON schemas provided intellisense, validation, and inline implementation instructions when using VS code to build deployment specifications.",
        "Identity": "I helped WBA design and implement their chained pipeline approach to separate the rights of template authors from service accounts, providing a least privilege solution.",
        "Data": "",
        "Modernize": "Most of the applications being migrated by the Microsoft engineers were lift-and-shift, but the solution left application teams with a WBA-approved CI/CD process for their underlying infrastructure.",
        "DevOps": "The approach leveraged Azure Dev Ops APIs, Powershell Core, and the Azure CLI to allow migration teams to stand up a new pipeline, provision baseline application specifications, and establish a backlog to track their progress. Linked repositories provide implementation isolation from migration work. A versioning strategy ensured older pipeline implementations will continue to run, even as the deployment schemas and pipelines matured and new features and strutures were introduced."
      }
    },
    {
      "role": "Application Uplift Architect",
      "company": "Hershey Entertainment",
      "via": "Blue Chip Consulting Group",
      "brief": "Envision and Plan engagement to help Hershey Entertainment prepare for an Azure migration of a number of LAMP-based self-hosted applications.",
      "description": "Hershey Entertainment and Resorts was interested in a lift-and-shift solution for their key LOB applications. They were interested in modernization opportunities as they moved to the cloud and explore phased uplift approaches to accelerate adoption. The final deliverable to the client included a three-step plan for the migration effort and estimated runtime costs based on current traffic across multiple web sites.",
      "start": "01/2020",
      "end": "02/2020",
      "tags": {
        "Cloud": "I determined that many of the LAMP projects were ready for a low-impact migration to Azure App Service on Linux paired with Azure Storage and Azure's CDN offerings for static assets. The primary booking engine was built on top of a CMS system which required deployment to a Linux VM, rather than a PaaS offering. I worked with the CMS vendor to determine the appropriate SKUs and deployment architecture for an Azure presence.",
        "Code": "",
        "Identity": "The migration plan deliverable included adoption of Azure Active Directory for administrative accounts and Azure RBAC.",
        "Data": "",
        "Modernize": "Hershey management was eager to move away from having to manage virtual machines and network architecture. Our final design moved all but a single workload to PaaS offerings with regional vnet connectivity and introduced a governance model to set them on a path toward better security and traceabilty.",
        "DevOps": "I trained the Hershey Entertainment development teams on proper DevOps solutions and presented them with a preliminary target state for CI/CD. Prior to the engagement, the team used mapped drives and SSH to push new versions to production from developer laptops."
      }
    },
    {
      "role": "Azure Dev Ops Automation Engineer",
      "company": "NC4",
      "via": "Blue Chip Consulting Group",
      "brief": "A divestiture required carving out code, processes, backlog items, and identites for several Azure Dev Ops projects, rehoming them in a new organization.",
      "description": "NC4 sold off a portion of their business based on an application which another team at Blue Chip built. I was brought in to migrate projects, backlogs, code, and user accounts in Azure Dev Ops to a new organization as part of the reorganization. The migration included custom scripts which leveraged Azure Dev Ops APIs to pump data across organizations and a third party tool to migrate an intact work item history. This work inspired the post I wrote explaining how to  <a href='https://dev.to/jkewley/migrate-azure-devops-work-item-queries-to-a-new-organization-2ogb' target='_blank'>Migrate Azure DevOps work item queries to a new organization</a>.",
      "start": "12/2019",
      "end": "09/2019",
      "tags": {
        "Cloud": "",
        "Code": "PowerShell scripts leveraging the Azure CLI were written to migrate many of the legacy data points, including identities, custom queries, and custom processes.",
        "Identity": "The organization reorg required connecting identities across two Active Directories to retain historical ownership records.",
        "Data": "",
        "Modernize": "",
        "DevOps": "This engagement operated completely withing Azure Dev Ops and leveraged several of the core REST APIs to help with the migration and validation processes."
      }
    },
    {
      "role": "IoT App Modernization Architect",
      "company": "GrafTech International",
      "via": "Blue Chip Consulting Group",
      "brief": "Envision and Plan engagement to help a commercial furnace manufacturer modernize their industry-defining application as it was moved to Azure.",
      "description": "GrafTech, an industrial steel furnace manufacturer, looked to Blue Chip for guidance on how to uplift thier industry-leading SaaS application into Azure. I worked with the development team to analyze the existing application and provide strategies and cost projections for the modernization effort.  The client was presented with multiple roadmaps which included a multi-phased approach for modernization efforts and Azure cost estimates for each. Development and training engagements was also presented to the client, who had limited development skillsets on staff.",
      "start": "09/2019",
      "end": "10/2019",
      "tags": {
        "Cloud": "Azure IoT Hub was the centerpiece of the modernized approach, with Azure Functions, Azure Storage, Service Bus, and Logic apps orchestrating on the back end. The solution modernized the way application code was writtten and tested, replaced email-based data collection with Azure IoT offerings, and introduced a long-term big data strategy.",
        "Code": "The exiting solution had almost all of its logic in SQL stored procedures, including custom business rules for specific clients. Our proposal included moving that logic to code and building unit tests to prove the system worked as designed for their myriad business cases.",
        "Identity": "The existing GrafTech solution leveraged local admin accounts and SQL credentials, and the reporting portal was a home-brew identity solution which stored user accounts in a database. The roadmap replaced those assets with Azure AD for employees and Azure AD B2C for customers.",
        "Data": "Furnaces fed data to a central respoitory throughout the day, but the existing platform lacked the ability to read and read to incoming information. The proposed solution introduced a big data component which would provide real-time reporting and alerting, creating new market opportunites for the client.",
        "Modernize": "The existing solution relied on email to send data gathered at the furnace to a central repository. The devices they had in the field supported MQTT and Azure IoT Hub natively, so our suggestion took them in that direction.",
        "DevOps": "I trained the GrafTech IT team on proper DevOps solutions and presented them with a preliminary target state for CI/CD."
      }
    },
    {
      "role": "Team Lead / Developer",
      "company": "Save The Children",
      "via": "Blue Chip Consulting Group",
      "brief": "",
      "description": "Save the Children found themselves in dire need of a rapidly-developed product to help them better track their emergency response efficiency during natural disasters. They were looking to replace an Excel spreadsheet which had become too big and cumbersome to open and share across teams. It needed to support team collaboration for data gathering, be easy to access but secure enough to handle sensivtive data, and provide dynamic reporting capabilities which would change with time. I designed a replacement built on the Universal Windows Platform with a back end powered by Azure serverless platform, delivering data into Azure Data Lake for Power BI reporting. The delivery target was aggressive, with the solution needing to be in place before hurricane season began in August.",
      "start": "05/2019",
      "end": "08/2019",
      "tags": {
        "Cloud": "The back end ran in Azure, and included an API layer, SQL database and storage accounts. Data Factory moved data from the Azure SQL back end to a Data Lake, where it was leveraged by Power BI.",
        "Code": "The product was built on UWP with an API layer written in .Net. Production builds were distributed internally via the Microsoft Store for Business.",
        "Identity": "The application leveraged RBAC based on AAD groups to restrict access to the tool as a whole and to administative screens inside. OAuth secured access to the back end APIs.",
        "Data": "The solution leveraged Azure Data Factory to pump application metrics to Azure Data Lake which Power BI reports read from.",
        "Modernize": "The primary driver for the engagement was to help employees who were sharing data via an emailed Excel spreadsheet by providing them with a user-friendly, usable tool which was secure but offered broad, shared access across the organization.",
        "DevOps": "All aspects of the Azure infrastructure were deployed using a CI/CD process backed by Azure Dev Ops. While the Microsoft Store for Business didn't offer an API-based submission process, the client can still build new versions of the application in the cloud and submit them to the store directly. Non-production builds were distributed via sideloading with automatic updates from versions delivered to Azure App Service."
      }
    },
    {
      "role": "SAP Uplift DevOps Engineer",
      "company": "Walgreens Boots Alliance",
      "via": "Microsoft Consulting Services",
      "brief": "Worked with Microsoft SAP SMEs and Azure product groups to pilot early stage migrations of WBA's SAP infrastructure to Azure.",
      "description": "As a tip-of-the-spear automation engineer on WBA's SAP migration to Azure, I worked directly with Microsoft SAP subject matter experts to build tooling which deployed scores of servers. During testing phases the Microsoft team would leverage this tooling to iterate on deployment specifications. I had the opportunity to work with product teams within Microsoft to help test newer Azure features related to high performance computing and proximity placement groups. The Microsoft SMEs were very impressed with the delivery, and provided ongoing positive feedback to Blue Chip management.",
      "start": "04/2019",
      "end": "05/2020",
      "tags": {
        "Cloud": "The SAP infrastructure was entirely IaaS and had intricate networking and proximity placement requirements based on SAP deployment specifications. Proximity Placement Groups were new in Azure, so I worked with the product team to exercise several unpublished ARM features.",
        "Code": "PowerShell was the tool of choice for this engagement, with standards defined in YAML and specifications for VMs gathered in Excel spreadsheets.",
        "Identity": "The nature of the engagement allowed for individual RBAC access to target subscriptions, so tooling leveraged PowerShell APIs to authenticate end users.",
        "Data": "",
        "Modernize": "",
        "DevOps": "The solution was based on PowerShell and ARM templates. Input specifications were gathered in Excel spreadsheets due to the team's historical approach for collaboaration and iteration on VM specifications."
      }
    },
    {
      "role": "Cloud Readiness Consultant ",
      "company": "Designer Brands",
      "via": "Blue Chip Consulting Group",
      "brief": "Helped Designer Brands inventory internal applications and plan for future modernization efforts as they were moved to Azure.",
      "description": "Our team was brought in to help DSW move their Windows and Linux servers to the Azure cloud and to prepare the company for a cloud-first posture. My role was to help the team evaluate key internal custom software applications for cloud readiness and to establish a modernization roadmap for those applications which fit the bill.",
      "start": "02/2019",
      "end": "04/2019",
      "tags": {
        "Cloud": "",
        "Code": "This engagement included code analysis across several large internal business applications, some of which used very on-premises approaches to connectivity and identity. As part of my work, I helped the teams understand what would be required to modernize the code.",
        "Identity": "",
        "Data": "",
        "Modernize": "The applications relied heavily on Windows server features such as COM object registration, Windows services, and secret management. We helped the team understand the Azure offering which provided the most appropriate migration path.",
        "DevOps": "I introduced early-stage release automation for IaaS components based on CSV source file specifications."
      }
    },
    {
      "role": "App Modernization Architect",
      "company": "Save The Children",
      "via": "Blue Chip Consulting Group",
      "brief": "Envision and Plan engagement for a project to modernize the tool used to collect data on vulnerable children across the world.",
      "description": "I my role as project lead for this engagement, I hosted 4 weeks of collaborative requirements gathering sessions with stakeholders, STC leadership, and STC IT resources which focused on a business-critical application used by STC to collect information on at-risk children across the world. I worked with the impacted parties to document existing application functionality and build a modernization plan for taking it to the cloud. The multilingual solution would run on 500+ tablets and thousands of PCs in countries across the world, supporting secure data collection, a partially connected workforce, and multiple external systems integrations. A big data component rounded out the offering. The final deliverable from this engagement included a populated & prioritized backlog in Azure Dev Ops which represented the outcome of the application features, key decisions, and implementation plans for the modernized solution.",
      "start": "11/2018",
      "end": "02/2019",
      "tags": {
        "Cloud": "Data collection from the field would flow through a series of Azure Functions and Logic Apps, en-route to other systems of record.",
        "Code": "The proposed solution was to be built on the Universal Windows Platform with a back end powered by a number of offerings from the Azure platform.",
        "Identity": "The solution leveraged Azure Active Directory to provide identity services for STC employees and partners. Formal third parties would be onboarded through OAuth federation, including volunteers who would register with AAD B2C.",
        "Data": "The solution included integrations with the company CRM to feed an Azure Data Lake for real-time and long-term reporting requirements.",
        "Modernize": "The existing toolset was a blend of one-off custom applications, databases, and manual processes. This engagement focused on identifying and documenting this systems and work with key stakeholders across the globe to formulate a cloud-based replacement.",
        "DevOps": "STC understood that the key to success for a global always-on application is reliable release processes. The solution included the ability to target classes of end users during CI/CD rollouts of application upgrades."
      }
    },
    {
      "role": "Cloud Application Developer",
      "company": "BakerHostetler",
      "via": "Blue Chip Consulting Group",
      "brief": "Contributed to the back end of a data harvesting application which leveraged third party APIs to aggregate data on court proceedings.",
      "description": "Provided programming and design support to teammates who were working on a system which aggregates court proceedings data from multiple sources and external APIs to help the client better predict court case outcomes.",
      "start": "09/2018",
      "end": "11/2018",
      "tags": {
        "Cloud": "The system ran on Azure App Service and leveraged Key Vault for third party API authentication secrets. ",
        "Code": "Durable functions with a fan-out pattern were used to collect data points from across third party data providers, aggregate the data, and save it to Azure SQL.",
        "Identity": "",
        "Data": "The solution produced aggregated data points with client-specified data matching algorithms. The end result was a scoring mechanism for the predictability of court case outcomes across different legal fields.",
        "Modernize": "",
        "DevOps": "The solution was built and deployed via Azure Dev Ops Pipelines."
      }
    },
    {
      "role": "SharePoint Automation Engineer",
      "company": "L3 Technologies",
      "via": "Blue Chip Consulting Group",
      "brief": "Build a custom solution which allowed employees to deploy new SharePoint sites into Azure Government",
      "description": "I developed a custom SharePoint online provisioning solution in the Azure Government cloud based on Azure Functions. The client had a stong security posture which required custom automation features and enhanced monitoring mechanics to replace components which weren’t available in Azure Government at the time.",
      "start": "08/2018",
      "end": "11/2018",
      "tags": {
        "Cloud": "The solution leveraged Azure Functions, Azure Logic Apps, and Service Bus deployed to Azure Government.",
        "Code": "The tool was built on .Net, PowerShell, and the SharePoint APIs.",
        "Identity": "AAD and SharePoint groups were leveraged to restrict access to key application features, such as request and approval processes.",
        "Data": "",
        "Modernize": "",
        "DevOps": "Azure Government provided challenges with implementing CI/CD processes, but I did deliver scripted/automated deployment packages with every new version of the solution."
      }
    },
    {
      "role": "Team Lead, Systems Integrations",
      "company": "Bob Evans Restaurants",
      "via": "Blue Chip Consulting Group",
      "brief": "Team lead for an engagement which modernized integrations across all external vendors and partners by moving from on-premises scheduled jobs to Azure Functions, Logic Apps, and Dynamics 365.",
      "description": "In my second engagement with Bob Evans, I was responsible for leading a team of developers as we replaced more than 25 legacy systems integrations with modern solutions built on Azure Logic Apps and Azure Functions with connectivity to Dynamics 365. I designed best-practices solutions for security, application monitoring, and DevOps automation and managed the relationships and expectations across HR and IT business units.",
      "start": "11/2017",
      "end": "08/2018",
      "tags": {
        "Cloud": "The deliverables for this engagement were primarily a collection of Azure Functions and Logic Apps, with Application Insights to track availabilty and uptime. API Management was used for a common API layer. Application Insights was the standard for monitoring uptime and availability. Several of the integrations leveraged custom software running across multiple VMs, working together via Azure Service Bus messages and payloads stored in Azure Storage.",
        "Code": "Integrations were mostly developed in .Net, with a heavy reliance on D365. Some of the integrations had web front ends to allow for user interaction and monitoring. These web apps were hosted alongside the rest of the integration in the same resource group, and ran on Azure App Service.",
        "Identity": "Most integrations leveraged AAD for end user management and monitoring, while partner APIs each required their own authentication mechanisms.",
        "Data": "Many of the integrations were backed by dedicated Azure SQL instances, but the system of record was D365. The integrations ultimately read from or fed data into D365 via custom import processes, triggered by API calls.",
        "Modernize": "The thrust of this engagement was modernization and a wholesale migration of IT integrations to the cloud.",
        "DevOps": "The DevOps story grew over time at Bob Evans as the identity offerings in Azure matured during this timeframe. Each integration had an Azure Dev Ops pipeline, as did several shared services and APIs."
      }
    },
    {
      "role": "Team Lead, Member Portal Web Application",
      "company": "Save The Children",
      "via": "Blue Chip Consulting Group",
      "brief": "Lead the development of a tool used by STC teams to improve worldwide collaboration of child sponsorship opportunities.",
      "description": "Save the Children needed a web site to drive efficiency into the core business processes conducted with globally-distributed fundraising centers. I lead the project from envision and plan through delivery, serving as team leader, tech lead, and project manager. Azure Dev Ops was leveraged to coordinate alignment across our development team, STC business stakeholders and sponsors, and Blue Chip executive leadership.",
      "start": "04/2017",
      "end": "04/2017",
      "tags": {
        "Cloud": "The solution ran almost exclusively on PaaS offerings including App Service, Storage Accounts, API Management, Service Bus, and Azure Web Jobs and Functions. It included an IaaS component in the form of a stand-alone virtual machine which was used for the work of collecting and zipping up digital assets for delivery to authorized users.",
        "Code": "The tool was written in ASP.Net and utilized KnockoutJS with an OAuth protected MVC layer.",
        "Identity": "The solution required a multi-tenant AAD implementation to support US and international Azure Active Directories. AAD groups were used to populate application roles which were vlaidated by the API layer.",
        "Data": "A daily feed from the system of record for eligible children was used to populate the application database. The solution included a manual process for STC data engineers to pull 'reservations' into the CRM system, giving the team the freedom to perform ad-hoc loads during times of low utilization.",
        "Modernize": "The tool replaced a complex, ad-hoc, error-prone set of processes which included the use of email, spreadhseets, and manually-created files to collaborate across international offices.",
        "DevOps": "The entire application was backed by a CI/CD process, running off of Azure DevOps. After launch STC decided to spin down test environments to save money, knowing they could be stood back up in a few minutes via a pipeline."
      }
    },
    {
      "role": "Cloud Application Development Consultant",
      "company": "Bob Evans Restaurants",
      "via": "Blue Chip Consulting Group",
      "brief": "I helped the Bob Evans development teams understand how to build for a cloud-first future through training presentations and hands-on assistance with POCs.",
      "description": "During the first stages of Bob Evans' migration to Azure, I was brought in as a subject matter expert to help development teams from across the Bob Evans organization plan for uplift and modernization scenarios. I provided guidance on development and deployment strategies, performed hands-on coding and training activities, and helped the CTO and a team of directors build migration and staffing forecasts.",
      "start": "04/2017",
      "end": "05/2017",
      "tags": {
        "Cloud": "Some application teams were looking for guidance on how to move to PaaS from on-premises VMs. I helped these teams think through the challenges they would face and formulate an approach for the migration. In some cases I helped out by implementing POCs for them. Blue Chip had IaaS, identity, and modern workplace engineers on site to assist with lift-and-shift migrations. I helped them with application analysis and decisions on how to move forward.",
        "Code": "I build several web POCs to help the teams understand the role of authentication and CI/CD automation. Most of the code I delivered during this engagement was written in .Net, but I also delivered several PowerShell scripts to help Azure subscription owners with deployment and management tasks for things like Azure Dev Ops and service principals.",
        "Identity": "The identitfy stories in early 2107 weren't very mature yet, but I helped dev teams understand how to move from custom and LDAP authentication methods to Azure Active Directory.",
        "Data": "",
        "Modernize": "This engagement focused entriely on modernization efforts and involved me working with teams to understand what was possible in Azure from a modernization perspective.",
        "DevOps": "I helped Bob Evans get their Azure Dev Ops setup off the ground after leading the uplift of an on-premises Team Foundation Server. I trained development teams on Git and helped them get started with Gitflow development."
      }
    },
    {
      "role": "Application Development Consultant",
      "company": "MPRO",
      "via": "Blue Chip Consulting Group",
      "brief": "Helped a smaller non-profit organization understand their options for application modernization and a migration to Azure.",
      "description": "I served as project lead and primary developer on this engagement with a non-profit healthcare company. I provided the client with application architecture review, development of PowerShell scripts, and data migration assistance. I helped MPRO establish a path for cloud migration which was adopted in a future engagement. During my application review I uncovered several security issues which I remedied.",
      "start": "12/2016",
      "end": "03/2017",
      "tags": {
        "Cloud": "I helped MPRO migrate an existing internal web application to App Service and provided feedback and guidance for uplift strategies.",
        "Code": "I helped harden the security posture of the existing application and worked with the client to create a backlog of opportunities to improve security and application performance.",
        "Identity": "MRPO was very new to Azure and required assistance with AAD setup and configuration.",
        "Data": "I migrated the data from an on-premises SQL server to SQL Azure, cleaning out bad and erronous data in the process.",
        "Modernize": "I helped modernize the security aspect of the authentication mechanism by migrating the user base to AAD-backed identities.",
        "DevOps": ""
      }
    },
    {
      "role": "Web Developer",
      "company": "Wendys Restaurants",
      "via": "Blue Chip Consulting Group",
      "brief": "Developer on Wendy's Intranet solution",
      "description": "My first project at Blue Chip Consulting was improving and building on thier Intranet site which was hosted in SharePoint Online. I helped improve upon the reliability and workflow for their daily internal newsletter, built several remote event receivers for custom integrations, and wrote some client side JavaScript using the SharePoint libraries. <p>I helped the team solve behaviorial issues with several client side sorting and filtering features by developing unit tests in JUnit.</p>",
      "start": "10/2016",
      "end": "02/2017",
      "tags": {
        "Cloud": "Wendys used SharePoint Online for thier Intranet. Remote Event Receivers were deployed as Function Apps and WebJobs to Azure.",
        "Code": "The Intranet was hosted in SharePoint Online, so I had to deploy and develop from a custom SharePoint Online instance which made for a long inner dev loop. This lead me to write a blog post about <a href='https://dev.to/jkewley/use-fiddler-to-live-test-javascript-changes-to-your-web-site-1eeb' target='_blank'>using Fiddler to live-test JavaScript changes without deploying them</a>",
        "Identity": "Employees authentication leveraged an existing Azure AD. SharePoint Groups were used to restrict access to administrative areas, including those which provided the admin screens I developed for daily newsletter management.",
        "Data": "",
        "Modernize": "",
        "DevOps": ""
      }
    }
  ],
  "employment": [
    {
      "role": "Senior Solution Architect",
      "company": "Core BTS",
      "description": "Blue Chip Consulting Group was acquired by Core BTS in October of 2020",
      "end": "06/2021",
      "start": "10/2020"
    },
    {
      "role": "Senior Solution Architect",
      "company": "Blue Chip Consulting Group",
      "description": "In January of 2020 I was promoted to Senior Solution Architect.",
      "comment": "In addition to my consulting duties, I also contributed directly to the growth of the organization, including: <ul><li>Founding member of the Application Development focus area leadership team</li><li>Established technical interviewing process, including screening and scoring guidelines and feedback mechanisms</li><li>Piloted Azure Lighthouse implementation with key partners to help improve onboarding of our operations teams</li><li>Built a custom DevOps process for development projects which incorperated RAID logs and other Blue Chip key processes</li><li>Lead inventment in adoption of Postman Pro across the application development team with APIs and documentation provided as deliverables across engagements</li><li>As a leader for Blue Chip's 'Geo Growth' team for the Nashville region I was involved in community outreach, brand expansion, and local selling efforts",
      "end": "10/2020",
      "start": "01/2020"
    },
    {
      "role": "Solution Architect",
      "company": "Blue Chip Consulting Group",
      "description": "In April of 2017 I was promoted to Solution Architect.",
      "end": "01/2020",
      "start": "04/2017"
    },
    {
      "role": "Senior Consultant",
      "company": "Blue Chip Consulting Group",
      "description": "I joined Blue Chip Consulting in October of 2016 as a Senior Consultant.",
      "end": "04/2017",
      "start": "10/2016"
    },
    {
      "role": "Application Architect / Team Lead",
      "company": "eDoc4u",
      "description": "I started with eDoc4u as a senior developer, leading a small team of junior programmers in the development of a health and wellness assessment application. Within a few months I was promoted to application architect and began laying the framework for a new technical direction based on company growth projections. I designed and have been managing a migration from a multi-tenant monolithic asp.net application to a cloud-based SAAS model with dedicated tenant resources and lower, predictable TCO. I have also become a key contributor toward envisioning and building toward the company’s future.",
      "end": "10/2016",
      "start": "11/2013"
    },
    {
      "role": "Partner",
      "company": "Insario Corporation",
      "description": "As co-founder of Insario, I worked with my business partner to grow our small business from a fledgling startup to a powerful, focused company who provided technical expertise and business strategy services to American Express as they moved their products and services online. We grew from 2 to 10 employees over the course of 14 years despite economic and tech sector down-turns. Our customers appreciated our ability to help them innovate and deliver web-based tools and marketing material. <p/>Due to overwhelming appreciation and support from American Express business units, Insario was included in the list of 10 preferred technology vendors alongside companies like IBM and Tata consulting.",
      "end": "01/2013",
      "start": "06/1999"
    }
  ],
  "social": [{
      "service": "linkedin",
      "url": "https://www.linkedin.com/in/joshkewley"
    },
    {
      "service": "twitter",
      "url": "https://twitter.com/jkewley"
    },
    {
      "service": "angellist",
      "url": "https://angel.co/u/josh-kewley"
    },
    {
      "service": "github",
      "url": "https://github.com/jkewley"
    },
    {
      "service": "devto",
      "url": "https://dev.to/jkewley"
    },
    {
      "service": "stackoverflow",
      "url": "https://stackoverflow.com/story/joshkewley"
    }
  ]
}